app/views/players/_k.html.erb

SELECT "players".* FROM "players" WHERE "players"."drafted" = ? AND "players"."position" = ?  ORDER BY "players"."overall_rank" ASC  [["drafted", "f"], ["position", "K"]]
---
<%Player.all.where(:drafted => false).where(:position => 'K').order(:overall_rank).each do |player| %>