app/views/players/_my_team.html.erb

<%Player.all.where(:fantasy_team => "mine").order(:overall_rank).each do |player| %>
---
SELECT "players".* FROM "players" WHERE "players"."fantasy_team" = ?  ORDER BY "players"."overall_rank" ASC  [["fantasy_team", "mine"]]