app/views/players/_te.html.erb

<%Player.all.where(:drafted => false).where(:position => 'TE').order(:overall_rank).each do |player| %>
---
SELECT "players".* FROM "players" WHERE "players"."drafted" = ? AND "players"."position" = ?  ORDER BY "players"."overall_rank" ASC  [["drafted", "f"], ["position", "TE"]]