app/views/players/_undrafted.html.erb

<%Player.all.where(:drafted => false).order(:overall_rank).each do |player| %>
---
SELECT "players".* FROM "players" WHERE "players"."drafted" = ?  ORDER BY "players"."overall_rank" ASC  [["drafted", "f"]]