app/views/players/_wr.html.erb

SELECT "players".* FROM "players" WHERE "players"."drafted" = ? AND "players"."position" = ?  ORDER BY "players"."overall_rank" ASC  [["drafted", "f"], ["position", "WR"]]
---
<%Player.all.where(:drafted => false).where(:position => 'WR').order(:overall_rank).each do |player| %>