app/controllers/players_controller.rb

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "players" SET "drafted" = ?, "fantasy_team" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["drafted", "t"], ["fantasy_team", "mine"], ["updated_at", "2015-08-29 14:33:42.292873"], ["id", 5]]
---
  def drafted
    @player = Player.find(params[:player][:player_id])
    @player.drafted = true
    @player.fantasy_team = 'mine'
    @player.save

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "players" SET "drafted" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["drafted", "t"], ["updated_at", "2015-08-29 14:03:10.996027"], ["id", 1]]
---
  def update
    @player = Player.find(params[:player][:player_id])
    @player.drafted = true
    @player.save